---
type: KeyBasedTreeEntryTable
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# KeyBasedTreeEntryTable

`Autodesk.Revit.DB.KeyBasedTreeEntryTable` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetKeyBasedTreeEntries | 2015 | `public KeyBasedTreeEntries GetKeyBasedTreeEntries ()` |
| Method | LoadFrom | 2015 | `public ExternalResourceLoadStatus LoadFrom ( ExternalResourceReference desiredResourceReference , KeyBasedTreeEntriesLoadResults loadResults )` |
| Method | Reload | 2015 | `public ExternalResourceLoadStatus Reload ( KeyBasedTreeEntriesLoadResults loadResults )` |
| Method | ServerSupports | 2015 | `public bool ServerSupports ( ExternalResourceReference extRef )` |
| Property | Parameter | — | `` |